examples/hypersonic-intake-2p1o-hpc/input/case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5+                                    |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

// Refinements
angle 5;

// Geometry parameters
inletX  -13.623759245514563; // CHANGE ME
inletY  2.697762898834017;  // CHANGE ME
inletZ  0.1;
inletZ_neg  -0.1;

outletX 0.7741818097404216;  // CHANGE ME
outletY 0.630554673; // CHANGE ME
outletZ 0.1;
outletZ_neg -0.1;

inletX2 -25;        // CHANGE ME

div_x 550;
div_y 90;

vertices
(
    // block0 vertices (Intake)
    ($inletX           0           $inletZ)     // 00
    ($inletX           0          $inletZ_neg)     // 01
    ($inletX           $inletY      $inletZ) // 02 
    ($inletX           $inletY     $inletZ_neg) // 03
    ($outletX           0           $outletZ)     // 04
    ($outletX           0          $outletZ_neg)     // 05
    ($outletX           $outletY  $outletZ)    // 06
    ($outletX           $outletY  $outletZ_neg)    // 07

    // block1 vertices (Extruded outlet)
    //  ($outletX2      0           $outletZ)     // 08
    //  ($outletX2      0          $outletZ_neg)     // 09
    //  ($outletX2      $outletY  $outletZ)    // 010
    //  ($outletX2      $outletY  $outletZ_neg)    // 011

    // block2 vertices (Extruded inlet)
    ($inletX2           0           $inletZ)     // 012 -8
    ($inletX2           0          $inletZ_neg)     // 013 -9
    ($inletX2           $inletY     $inletZ) // 14 - 10
    ($inletX2           $inletY     $inletZ_neg) // 15 - 11
);

edges
(
    spline   6 2
    (
        (	0.7741818097404216	0.630554673	$inletZ	)
    )

    spline   7 3
    (
        (	0.7741818097404216	0.630554673	$inletZ_neg	)
    )
); 


blocks
(
    // block0
    hex (0 1 3 2 4 5 7 6) (1 $div_y $div_x) simpleGrading (1 1 -10)

    // block2
    hex (8 9 11 10 0 1 3 2) (1 $div_y 150) simpleGrading (1 1 1)
);


boundary
(
    inlet
    {
        type patch;
        faces
        (
            (8 10 11 9)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (4 6 7 5)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (10 2 3 11)
            (2 6 7 3)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 4 6 2)
            (8 0 2 10)
        );
    }
    back
    {
        type empty;
        faces
        (
            (1 3 7 5)
            (9 11 3 1)
        );
    }
    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 1 5 4)
            (8 9 1 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //